config.org
*** packages.el

packages file for doom sync to use to maintain the packages i use

#+begin_src emacs-lisp :tangle packages.el
;;; packages.el --- summary -*- lexical-binding: t; no-byte-compile: t; -*-
;;
;; author: marty buchaus <marty@dabuke.com>
;; copyright © 2021, marty buchaus, all rights reserved.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; packages

#+end_src
**** REST
#+begin_src emacs-lisp :tangle packages.el

(package! evil-snipe :disable t)

(package! aggressive-indent)
(package! alert)
(package! all-the-icons-completion)
(package! all-the-icons-dired)
(package! autoinsert)
(package! browse-kill-ring)
(package! company-nginx)
(package! company-tabnine)
(package! counsel-tramp)
(package! dashboard)
(package! docker-compose-mode)
(package! dockerfile-mode)
(package! doct)
(package! ebuku)
(package! elfeed-protocol)
(package! emmet-mode)
(package! hydra)
(package! info-colors)
(package! jenkinsfile-mode)
(package! json-mode)
(package! khalel)
(package! khardel)
(package! lsp-ui)
(package! mixed-pitch)
(package! mu4e-column-faces)
(package! mu4e-marker-icons)
(package! mutt-mode)
(package! nginx-mode)
(package! olivetti)
(package! org-edna)
(package! org-jira)
(package! org-noter)
(package! org-noter-pdftools)
(package! org-notifications)
(package! org-pdftools)
(package! org-projectile)
(package! org-ref)
(package! org-roam-bibtex)
(package! org-super-agenda)
(package! org-wild-notifier)
(package! ox-gfm)
(package! paperless)
(package! powerthesaurus)
(package! python-mode)
(package! salt-mode)
(package! systemd)
(package! wakatime-mode)

;;;;
;;(when (string= (system-name) "archovo.home.snuffy.org"))

(package! activity-watch-mode      :recipe (:host github :repo "pauldub/activity-watch-mode"))
(package! burly                    :recipe (:host github :repo "alphapapa/burly.el"))
(package! i3wm-config-mode         :recipe (:host github :repo "Alexander-Miller/i3wm-Config-Mode"))
(package! notdeft                  :recipe (:host github :repo "hasu/notdeft" :files ("*.el" "xapian")))
(package! org-appear               :recipe (:host github :repo "awth13/org-appear"))
(package! org-ol-tree              :recipe (:host github :repo "Townk/org-ol-tree"))
(package! org-pandoc-import        :recipe (:host github :repo "tecosaur/org-pandoc-import" :files ("*.el" "filters" "preprocessors")))
(package! org-pretty-table         :recipe (:host github :repo "Fuco1/org-pretty-table"))
(package! org-roam-timestamps      :recipe (:host github :repo "ThomasFKJorna/org-roam-timestamps"))
(package! org-roam-ui              :recipe (:host github :repo "org-roam/org-roam-ui" :files ("*.el" "out")))
(package! org-transclusion         :recipe (:host github :repo "nobiot/org-transclusion" :branch "main" :files ("*.el")))
(package! outshine                 :recipe (:host github :repo "alphapapa/outshine"))
(package! vlf                      :recipe (:host github :repo "m00natic/vlfi" :files ("*.el")))

#+end_src

